app/models/show.rb

    def self.stsearch(stsearch)
        if stsearch
            Show.where('shows.s_title like ?', "%#{stsearch}%").uniq
---
SELECT "shows".* FROM "shows" WHERE (shows.s_title like '%The%')

    def self.sssearch(sssearch)
        if sssearch
            Show.where('shows.s_studio like ?', "%#{sssearch}%").uniq
---
SELECT "shows".* FROM "shows" WHERE (shows.s_studio like '%lucas%')

    def self.sdsearch(sdsearch)
        if sdsearch
            Show.where('shows.s_director like ?', "%#{sdsearch}%").uniq
---
SELECT "shows".* FROM "shows" WHERE (shows.s_director like '%dave%')

    def self.sgsearch(sgsearch)
        if sgsearch
            Show.joins("Inner Join showgenres On showgenres.sg_showid = shows.s_showid").joins("Inner Join genres On genres.g_genreid = showgenres.sg_genreid").where('genres.g_genrename like ?', "%#{sgsearch}%").uniq
---
SELECT "shows".* FROM "shows" Inner Join showgenres On showgenres.sg_showid = shows.s_showid Inner Join genres On genres.g_genreid = showgenres.sg_genreid WHERE (genres.g_genrename like '%action%')

    def self.sasearch(sasearch)
        if sasearch
            Show.joins("Inner Join showactors On showactors.sa_showid = shows.s_showid").joins("Inner Join actors On actors.a_actorid = showactors.sa_actorid").where('actors.a_actorname like ?', "%#{sasearch}%").uniq
---
SELECT "shows".* FROM "shows" Inner Join showactors On showactors.sa_showid = shows.s_showid Inner Join actors On actors.a_actorid = showactors.sa_actorid WHERE (actors.a_actorname like '%pedro%')